app/controllers/vehicles_controller.rb

	def index
		@vehicles = Vehicle.all
---
SELECT "vehicles".* FROM "vehicles"

	def show
		@vehicle = Vehicle.find params[:id]
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

	def create
		@vehicle = Vehicle.create! vehicle_params
---
INSERT INTO "vehicles" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-10-23 20:57:23.173515"], ["updated_at", "2018-10-23 20:57:23.173515"]]

	def edit
		@vehicle = Vehicle.find params[:id]
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@vehicle = Vehicle.find params[:id]
		@vehicle.update_attributes! vehicle_params
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "vehicles" SET "name" = ?, "updated_at" = ? WHERE "vehicles"."id" = ?  [["name", "v3"], ["updated_at", "2018-10-23 23:18:17.960031"], ["id", 2]]

	def destroy
		@vehicle = Vehicle.find params[:id]
		@vehicle.destroy
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 3]]